
1. DEFINE A PANDAS DATAFRAME

In [1]:
#Series in pandas is one dimensional whereas the pandas dataframe is multifunctional
import pandas as pd

In [2]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_client_df = pd.DataFrame({'Bank Client ID':[111, 222, 333, 444],
                               'Bank Client Name': ['Nihar','Nikhil','Nirup','Gaurav'],
                               'Net Worth[$]':[35000, 3000, 100000, 2000],
                               'Years with BANK':[4,7,8,15]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth[$]  Years with BANK
0             111            Nihar         35000                4
1             222           Nikhil          3000                7
2             333            Nirup        100000                8
3             444           Gaurav          2000               15

In [3]:
# Let's obtain the data type 
type(bank_client_df)

pandas.core.frame.DataFrame

In [4]:
# you can only view the first couple of rows using .head()
bank_client_df.head()

   Bank Client ID Bank Client Name  Net Worth[$]  Years with BANK
0             111            Nihar         35000                4
1             222           Nikhil          3000                7
2             333            Nirup        100000                8
3             444           Gaurav          2000               15

In [5]:
# you can only view the last couple of rows using .tail()
bank_client_df.tail()

   Bank Client ID Bank Client Name  Net Worth[$]  Years with BANK
0             111            Nihar         35000                4
1             222           Nikhil          3000                7
2             333            Nirup        100000                8
3             444           Gaurav          2000               15

In [6]:
# You can obtain the shape of the DataFrame (#rows, #columns)
bank_client_df.shape

(4, 4)

In [7]:
# Obtain DataFrame information 
bank_client_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Bank Client ID    4 non-null      int64
 1   Bank Client Name  4 non-null      object
 2   Net Worth[$]      4 non-null      int64
 3   Years with BANK   4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

**MINI CHALLENGE #1:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [8]:
portfolio_df = pd.DataFrame({'Stocks':['apple','amazon','google','tesla'],
                             'Ticker':['app','amz','ggl','tsl'],
                             'Number of shares':[30,50,70,100],
                             'Share price':[202,175,160,240],})
portfolio_df

   Stocks Ticker  Number of shares  Share price
0   apple    app                30          202
1  amazon    amz                50          175
2  google    ggl                70          160
3   tesla    tsl               100          240

In [9]:
ab = portfolio_df['Share price']

In [10]:
bc = portfolio_df['Number of shares']

In [11]:
stocks_dollar_value = ab*bc
stocks_dollar_value

0     6060
1     8750
2    11200
3    24000
dtype: int64

In [12]:
stocks_dollar_value.sum()

50010

# 2. INPUTS (READ CSV AND HTML DATA)

In [13]:
# Pandas is used to read a csv file and store data in a DataFrame
ssup = pd.read_csv('N:\Personal Learning\Pandas\Pandas_Series\S_P500_Prices.csv')
ssup

            sp500
0     1295.500000
1     1289.089966
2     1293.670044
3     1308.040039
4     1314.500000
...           ...
2154  3327.770020
2155  3349.159912
2156  3351.280029
2157  3360.469971
2158  3333.689941

[2159 rows x 1 columns]

In [14]:
# Read tabular data using read_html
house_prices_df = pd.read_html(' https://www.ssa.gov/oact/progdata/nra.html')
house_prices_df[0]

,Year of birth,Age
0,1937 and prior,65
1,1938,65 and 2 months
2,1939,65 and 4 months
3,1940,65 and 6 months
4,1941,65 and 8 months
5,1942,65 and 10 months
6,1943-54,66
7,1955,66 and 2 months
8,1956,66 and 4 months
9,1957,66 and 6 months
10,1958,66 and 8 months
11,1959,66 and 10 months
12,1960 and later,67
13,Notes: 1. Persons born on January 1 of any yea...,Notes: 1. Persons born on January 1 of any yea...

# 3. OUTPUTS (WRITE DATAFRAME INTO CSV)

In [15]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_df= pd.read_csv(r'N:\Personal Learning\Pandas\Pandas_Series\bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [16]:
bank_df.to_csv('sample_index.csv', index=True)
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

**MINI CHALLENGE #3:**
- **Use set index = False and rerun the cell. Comment on the output CSV.**
- **Try to leverage the attribute compression and rerun the cell**

In [17]:
bank_df.to_csv('sample_flase_index.csv', index=False)
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

# 4. SETTING/RESETTING INDEX

In [18]:
# Pandas is used to read a csv file and store data in a DataFrame
# Note that a numeric index is being set by default
bank_df= pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [19]:
# You can assign a specific column to be the index as follows
bank_df.set_index('First Name', inplace=True)
bank_df

,Last Name,Email,Postal Code,Net Worth,Years with Bank
First Name,,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [20]:
# You can go back and use numeric index using reset_index

bank_df.reset_index(inplace=True)
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [21]:
# Alternatively, you can set the index name when you read the csv file as follows
bank_df = pd.read_csv('bank_client_information.csv', index_col='First Name')
bank_df

,Last Name,Email,Postal Code,Net Worth,Years with Bank
First Name,,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

**MINI CHALLENGE #4:**
- **Load the bank_client_information.csv and then set the "Last Name" column as the index**

In [22]:
bank_df = pd.read_csv('bank_client_information.csv', index_col='Last Name')
bank_df

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Steve,Bird,bird@gmail.com,N94 3M0,5000.00,5
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Steve,Chanel,chanel@gmail.com,N7T 3E6,11072.02,10
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

# 5. SELECTING COLUMNS FROM A DATAFRAME

In [23]:
# Pandas is used to read a csv file and store data in a DataFrame
banking_df = pd.read_csv(r'bank_client_information.csv')
banking_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [24]:
# Return a column from the DataFrame
# Note that the output will be a Pandas Series (you can automatically tell by the lack of formating)
sample = banking_df['Email']
sample

0             bird@gmail.com
1         nsmall@hotmail.com
2            azikez@gahew.mr
3           chanel@gmail.com
4           kate@hotmail.com
5            samer@gmail.com
6    heba.ismail@hotmail.com
7        Laila.a@hotmail.com
8             daafeja@boh.jm
9          guutodi@bigwoc.kw
Name: Email, dtype: object

In [25]:
type(sample)

pandas.core.series.Series

In [26]:
# Alternatively, you can use the following syntax to do the same
# Note that this method will not work if there are spaces in the column names
banking_df.Email

0             bird@gmail.com
1         nsmall@hotmail.com
2            azikez@gahew.mr
3           chanel@gmail.com
4           kate@hotmail.com
5            samer@gmail.com
6    heba.ismail@hotmail.com
7        Laila.a@hotmail.com
8             daafeja@boh.jm
9          guutodi@bigwoc.kw
Name: Email, dtype: object

In [27]:
# Since the column name has spaces, this will be the only way that will work!

banking_df['Net Worth']

0      5000.00
1     10000.00
2      9072.02
3     11072.02
4      5000.00
5    100000.00
6     50000.00
7     20000.00
8      2629.13
9      8626.96
Name: Net Worth, dtype: float64

In [28]:
# Let's select multiple columns from the DataFrame
# you need to define a list containing all column names that you would like to select
# Note that since we collected more than one column, the output is a DataFrame (Notice the rich formatting)
sample = banking_df[['First Name','Last Name', 'Net Worth']]
sample

  First Name Last Name  Net Worth
0      Bird      Steve    5000.00
1       Noah     Small   10000.00
2       Nina    Keller    9072.02
3    Chanel      Steve   11072.02
4       Kate      Noor    5000.00
5      Samer        Mo  100000.00
6       Heba    Ismail   50000.00
7      Laila     Ahmed   20000.00
8     Joseph    Patton    2629.13
9       Noah     Moran    8626.96

In [29]:
# Note that sample is now a DataFrame and not a Pandas Series (since it has multiple columns)
# You can use type to confirm or you can tell from the rich text formating
type(sample)

pandas.core.frame.DataFrame

In [30]:
# Alternatively, you can define a list first and then use it to select columns
my_selection = ['First Name','Last Name', 'Net Worth']
sample = banking_df[my_selection]
sample

  First Name Last Name  Net Worth
0      Bird      Steve    5000.00
1       Noah     Small   10000.00
2       Nina    Keller    9072.02
3    Chanel      Steve   11072.02
4       Kate      Noor    5000.00
5      Samer        Mo  100000.00
6       Heba    Ismail   50000.00
7      Laila     Ahmed   20000.00
8     Joseph    Patton    2629.13
9       Noah     Moran    8626.96

In [31]:
# In order to access a given row in the dataframe
banking_df[0:2]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.0,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.0,6

**MINI CHALLENGE #5:**
- **Select the following columns from the dataFrame Net Worth, Years with Bank, and Postal Code**

In [32]:
sample = banking_df[['Net Worth','Years with Bank','Postal Code']]
sample

   Net Worth  Years with Bank Postal Code
0    5000.00                5     N94 3M0
1   10000.00                6     N8S 14K
2    9072.02                7     S1T 4E6
3   11072.02               10     N7T 3E6
4    5000.00               22     K8N 5H6
5  100000.00               26     J7H 3HY
6   50000.00               11     K8Y 3M8
7   20000.00                3     J8Y 3M0
8    2629.13                1     M6U 5U7
9    8626.96               13     K2D 4M9

# 6. ADDING/DELETING COLUMNS TO DATAFRAME

In [33]:
# Pandas is used to read a csv file and store data in a DataFrame
banking_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [34]:
# Let's assume that we want to add a new column to the dataframe
banking_df['Age'] = [20,25,30,35,40,45,50,55,60,65]
banking_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Age
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,20
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,25
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,30
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,35
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,40
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,45
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,50
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,55
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,60
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,65

In [35]:
# You can also insert a new column in a given position 
banking_df.insert(0, column='Credit Score', value=[500,525,550,575,600,625,650,675,700,725])

In [36]:
# Delete a column from a DataFrame
banking_df

,Credit Score,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Age
0,500,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,20
1,525,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,25
2,550,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,30
3,575,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,35
4,600,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,40
5,625,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,45
6,650,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,50
7,675,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,55
8,700,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,60
9,725,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,65

In [37]:
# Remove a column from a DataFrame and store it somehwere else using pop
del banking_df['Email']
banking_df

,Credit Score,First Name,Last Name,Postal Code,Net Worth,Years with Bank,Age
0,500,Bird,Steve,N94 3M0,5000.00,5,20
1,525,Noah,Small,N8S 14K,10000.00,6,25
2,550,Nina,Keller,S1T 4E6,9072.02,7,30
3,575,Chanel,Steve,N7T 3E6,11072.02,10,35
4,600,Kate,Noor,K8N 5H6,5000.00,22,40
5,625,Samer,Mo,J7H 3HY,100000.00,26,45
6,650,Heba,Ismail,K8Y 3M8,50000.00,11,50
7,675,Laila,Ahmed,J8Y 3M0,20000.00,3,55
8,700,Joseph,Patton,M6U 5U7,2629.13,1,60
9,725,Noah,Moran,K2D 4M9,8626.96,13,65

**MINI CHALLENGE #6:**
- **load the bank_client_information.csv file and perform the following: (assume any reasonable values)** 
    - **Add a column indicating whether the client has a mortgage or not**
    - **Add a column indicating the value of mortage in dollars**

In [38]:
banking_df = pd.read_csv(r'bank_client_information.csv')
banking_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [39]:
banking_df['Mortgage']=['5000','10000','15000','20000','25000','30000','35000','40000','45000','50000']
banking_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Mortgage
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,5000
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,10000
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,15000
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,20000
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,25000
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,30000
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,35000
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,40000
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,45000
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,50000

# 7. LABEL-BASED ELEMENTS SELECTION FROM A DATAFRAME ".LOC()"

In [40]:
# Load the csv file and set the last name as the index
banking_df = pd.read_csv(r'bank_client_information.csv',index_col='Last Name')
banking_df

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Steve,Bird,bird@gmail.com,N94 3M0,5000.00,5
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Steve,Chanel,chanel@gmail.com,N7T 3E6,11072.02,10
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [41]:
# Sort the dataframe in an alphabetical order
banking_df.sort_index( inplace=True)
banking_df

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Steve,Bird,bird@gmail.com,N94 3M0,5000.00,5
Steve,Chanel,chanel@gmail.com,N7T 3E6,11072.02,10

In [42]:
# loc is used to filter rows and columns
# loc is label-based meaning you need to give a name of the rows (or columns) that you are interested in selecting
# Note that iloc is "integer index-based" meaning you can filter rows/columns by their integer index.
# Note that we obtained a Series because last name "Small" existed only once in the dataframe

banking_df.loc['Small']

First Name                       Noah
Email              nsmall@hotmail.com
Postal Code                   N8S 14K
Net Worth                     10000.0
Years with Bank                     6
Name: Small, dtype: object

In [43]:
# Note that you got a DataFrame back since Last Name 'Steve' existed more than one in the DataFrame
banking_df.loc['Steve']

          First Name             Email Postal Code  Net Worth  Years with Bank
Last Name
Steve          Bird     bird@gmail.com     N94 3M0    5000.00                5
Steve        Chanel   chanel@gmail.com     N7T 3E6   11072.02               10

In [44]:
# Note that you can select multiple rows using "colon :"
# Note that this is inclusive! meaning that "Ahmed" and "Patton" were selected in the output DataFrame
# Headsup: this will be different if we use integer based index such as iloc()

banking_df['Ahmed':'Patton']

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1

In [45]:
# Select all elements up to and including 'Keller' index
# Ensure the index is set to the correct column
banking_df.loc[:'Keller']

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7

In [46]:
# if you want to select multiple rows, you can pass them as a list as follows
banking_df.loc[['Keller','Steve','Mo']]

          First Name             Email Postal Code  Net Worth  Years with Bank
Last Name
Keller          Nina   azikez@gahew.mr     S1T 4E6    9072.02                7
Steve          Bird     bird@gmail.com     N94 3M0    5000.00                5
Steve        Chanel   chanel@gmail.com     N7T 3E6   11072.02               10
Mo             Samer   samer@gmail.com     J7H 3HY  100000.00               26

In [47]:
# You can also randomly select a fraction of the DataFrame
# Setting axis = 0 means rows, setting index = 1 means columns
banking_df.sample(n=5, axis=0)

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Steve,Bird,bird@gmail.com,N94 3M0,5000.00,5

In [48]:
# return a percentage (Ex: 30%) of the rows 
banking_df.sample(frac=0.3, axis=0)

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7

**MINI CHALLENGE #7:**
- **Load the csv data and use the "first name" column as the index**
- **Randomly select 2 rows from the DataFrame. Rerun the code and ensure that random rows are being selected**

In [49]:
banks = pd.read_csv(r'bank_client_information.csv')
banks

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [50]:
banks.set_index('First Name')

,Last Name,Email,Postal Code,Net Worth,Years with Bank
First Name,,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [51]:
banks.sample(n=2, axis=0)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22

# 8. INTEGER INDEX-BASED ELEMENTS SELECTION FROM A DATAFRAME "iLOC()"

In [55]:
# Load the CSV file with default index
banking_df = pd.read_csv(r"N:\Personal Learning\Pandas\Pandas_Series\bank_client_information.csv")
banking_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [57]:
# You can access rows with their numeric index using iloc
banking_df.iloc[4]

First Name                     Kate
Last Name                      Noor
Email              kate@hotmail.com
Postal Code                 K8N 5H6
Net Worth                    5000.0
Years with Bank                  22
Name: 4, dtype: object

In [58]:
# You can access multiple rows with their numeric index using iloc and colon :
# Note that using iloc is exclusive, meaning that we did not include the last element (quite confusing I know!)
# We went from index = 2 up until and not including index 5 so index 2,3, and 4 are the one selected
banking_df.iloc[2:5]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22

In [59]:
# all up until and not including index 4
banking_df.iloc[:4]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10

In [60]:
# Multiple elements are selected using a list of indexes 
banking_df.iloc[[2,4,6]]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11

In [61]:
# Slicing a piece of the dataframe by selecting which row and column you would like to select
banking_df.iloc[2, 2:4]

Email          azikez@gahew.mr
Postal Code            S1T 4E6
Name: 2, dtype: object

**MINI CHALLENGE #8:**
- **Write a code that selects the last two rows in the DataFrame using two different methods**

In [63]:
banking_df[-2:]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

# 9. BROADCASTING OPERATIONS & SETTING NEW DATAFRAME VALUES

In [ ]:
# Pandas is used to read a csv file and store data in a DataFrame

In [ ]:
# Let's assume that we want to update the networth of all our customers by $1000

In [ ]:
# Alternatively, you can add or subtract as follows

In [ ]:
# Let's convert from USD to CAD using the exchange rate 1 USD = 1.3 CAD

In [ ]:
# Decided to update the email address of a given customer

In [ ]:
# Let's assume we want to update the networth of two clients

**MINI CHALLENGE #9:**
- **Let's assume that all clients in the bank has been investing their assets in a broad S&P500 ETF. The market has been performing really well and clients networth has increased by 12% annualy. Calculate the sum of all client's networth.**

In [64]:
#mini

SyntaxError: invalid syntax (4172430347.py, line 1)